sample/swarm/swarm-sn-wrk-mixed-c6525-25g-exp13-havail0-hori1-verti0-infi1-client1-t4-c512-d30-R1500
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=1500
Running 30s test @ http://10.10.1.5:8080
  4 threads and 512 connections
  Thread calibration: mean lat.: 2.427ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.466ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.482ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.446ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.80ms    1.58ms   6.10ms   53.70%
    Req/Sec   392.33    204.73     0.90k    70.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.35ms
 75.000%    4.01ms
 90.000%    4.52ms
 99.000%    6.10ms
 99.900%    7.67ms
 99.990%    9.46ms
 99.999%   14.58ms
100.000%   14.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.457     0.000000            1         1.00
       0.801     0.100000         2966         1.11
       0.897     0.200000         5925         1.25
       1.053     0.300000         8887         1.43
       2.543     0.400000        11850         1.67
       3.353     0.500000        14814         2.00
       3.545     0.550000        16296         2.22
       3.677     0.600000        17781         2.50
       3.787     0.650000        19263         2.86
       3.897     0.700000        20739         3.33
       4.011     0.750000        22218         4.00
       4.071     0.775000        22954         4.44
       4.139     0.800000        23720         5.00
       4.207     0.825000        24469         5.71
       4.291     0.850000        25176         6.67
       4.391     0.875000        25924         8.00
       4.455     0.887500        26290         8.89
       4.523     0.900000        26667        10.00
       4.611     0.912500        27037        11.43
       4.711     0.925000        27402        13.33
       4.835     0.937500        27770        16.00
       4.915     0.943750        27956        17.78
       4.995     0.950000        28139        20.00
       5.075     0.956250        28328        22.86
       5.191     0.962500        28513        26.67
       5.315     0.968750        28698        32.00
       5.395     0.971875        28789        35.56
       5.475     0.975000        28879        40.00
       5.563     0.978125        28971        45.71
       5.659     0.981250        29063        53.33
       5.783     0.984375        29157        64.00
       5.847     0.985938        29204        71.11
       5.955     0.987500        29248        80.00
       6.047     0.989062        29297        91.43
       6.135     0.990625        29341       106.67
       6.255     0.992188        29387       128.00
       6.351     0.992969        29410       142.22
       6.427     0.993750        29433       160.00
       6.539     0.994531        29457       182.86
       6.631     0.995313        29480       213.33
       6.723     0.996094        29503       256.00
       6.827     0.996484        29515       284.44
       6.915     0.996875        29526       320.00
       7.023     0.997266        29538       365.71
       7.131     0.997656        29549       426.67
       7.287     0.998047        29561       512.00
       7.343     0.998242        29566       568.89
       7.415     0.998437        29572       640.00
       7.527     0.998633        29578       731.43
       7.639     0.998828        29584       853.33
       7.771     0.999023        29590      1024.00
       7.827     0.999121        29592      1137.78
       7.855     0.999219        29595      1280.00
       7.951     0.999316        29598      1462.86
       8.043     0.999414        29601      1706.67
       8.191     0.999512        29604      2048.00
       8.263     0.999561        29605      2275.56
       8.327     0.999609        29607      2560.00
       8.527     0.999658        29608      2925.71
       8.623     0.999707        29610      3413.33
       8.655     0.999756        29611      4096.00
       8.991     0.999780        29612      4551.11
       8.999     0.999805        29613      5120.00
       8.999     0.999829        29613      5851.43
       9.391     0.999854        29614      6826.67
       9.463     0.999878        29615      8192.00
       9.463     0.999890        29615      9102.22
       9.487     0.999902        29616     10240.00
       9.487     0.999915        29616     11702.86
       9.487     0.999927        29616     13653.33
      10.687     0.999939        29617     16384.00
      10.687     0.999945        29617     18204.44
      10.687     0.999951        29617     20480.00
      10.687     0.999957        29617     23405.71
      10.687     0.999963        29617     27306.67
      14.583     0.999969        29618     32768.00
      14.583     1.000000        29618          inf
#[Mean    =        2.795, StdDeviation   =        1.577]
#[Max     =       14.576, Total count    =        29618]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  44333 requests in 30.01s, 293.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 21
Requests/sec:   1477.41
Transfer/sec:      9.78MB